motoneil1/STC3117_arduino/stc3117_Driver.cpp
#include "Arduino.h"
#include "Wire.h"
#include "stc3117_Driver.h"
#include "stc3117_I2C.h"
#include "stc3117_Battery.h"





/* ******************************************************************************** */
/*        I2C FUNCTIONS FOR ARDUINO                                                 */
/* -------------------------------------------------------------------------------- */



int My_I2C_Write(int length, int reg, unsigned char *data, int address) {
    int returnValue = -1;
    Wire.beginTransmission(address);
    Wire.write(reg);

    for (int i = 0; i < length; i++) {
        Wire.write(data[i]);
    }

    if (Wire.endTransmission() != 0) {
        returnValue = -1;
    }
    else returnValue = 0;
    return returnValue;

}
int I2C_Write(int NumberOfBytes, int RegAddress , unsigned char *TxBuffer)
{
	int res=-1;

	res = My_I2C_Write(NumberOfBytes, RegAddress, TxBuffer, STC3117_SLAVE_ADDRESS);

  return(res);
}



int My_I2C_Read(int length, int reg, unsigned char *output, int address) {
    int returnValue = 0;
    int counter = 0;
    int temp = 0;

    Wire.beginTransmission(address);
    Wire.write(reg);
    if (Wire.endTransmission() != 0) {
        returnValue = -1;
    } else {
        int readLength = 0;
        int readTimeout = 300;
        unsigned long start = millis();
        do {
            readLength = Wire.requestFrom(address, length);
            if (readLength == length) {
                for (int i = 0; i < readLength; i++) {
                    temp = Wire.read();
                    *output = temp;
                    output++;
                }
                break;
            }
        } while (millis() - start >= readTimeout);
    }

    if (Wire.endTransmission() == 0) {
      returnValue = 0;      
    }

    return returnValue;
}

int I2C_Read(int NumberOfBytes, int RegAddress , unsigned char *RxBuffer)
{
	int res=-1;
	res = My_I2C_Read(NumberOfBytes, RegAddress, RxBuffer, STC3117_SLAVE_ADDRESS);
  
	
  return(res);    
}


/* ---- End of Arduino I2C functions ------------------------------------------ */


/* ---- STC3117 I2C R/W interface --------------------------------------------- */

/*******************************************************************************
* Function Name  : STC3117_ReadByte
* Description    : utility function to read the value stored in one register
* Input          : RegAddress: STC3117 register,
* Return         : 8-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadByte(int RegAddress)
{
  int value;
  unsigned char data[2];
  int res;

  res = I2C_Read(1, RegAddress , data);
	
  if (res >= 0)
  {
    /* no error */
    value = data[0];
  }
  else
    value=-1;

  return(value);
}



/*******************************************************************************
* Function Name  : STC3117_WriteByte
* Description    : utility function to write a 8-bit value into a register
* Input          : RegAddress: STC3117 register, Value: 8-bit value to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteByte(int RegAddress, unsigned char Value)
{
  int res;
  unsigned char data[2];

  data[0]= Value;
  res = I2C_Write(1, RegAddress , data);
	
  return(res);

}


/*******************************************************************************
* Function Name  : STC3117_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3117 register,
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadWord(int RegAddress)
{
  int value;
  unsigned char data[2];
  int res;

  res = I2C_Read(2, RegAddress , data);
  
  if (res >= 0)
  {
    /* no error */
    value = data[1];
    value = (value <<8) | data[0];
  }
  else
    value=-1;

  return(value);
}

int STC3117_ReadUnsignedWord(unsigned short RegAddress, unsigned short * RegData)
{
  unsigned short data16;
  unsigned char data8[2];
  int status;

  status = I2C_Read(2, RegAddress , data8);
  
  if (status >= 0)
  {
    /* no error */
    data16 = data8[1];
    data16 = (data16 <<8) | data8[0];
    *RegData = data16;
  }
  else
    status = -1;

  return(status);
}

/*******************************************************************************
* Function Name  : STC3117_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3117 register, Value: 16-bit value to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteWord(int RegAddress, int Value)
{
  int res;
  unsigned char data[2];

  data[0]= Value & 0xff; 
  data[1]= (Value>>8) & 0xff;
  
  res = I2C_Write(2, RegAddress , data);
	
  return(res);

}

/*******************************************************************************
* Function Name  : STC3117_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3117 register, nbr: number of bytes to read
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadBytes(unsigned char *data,int RegAddress,int nbr)
{
  int res;

  res = I2C_Read(nbr, RegAddress , data);
  
  return(res);
}


/*******************************************************************************
* Function Name  : STC3117_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3117 register, Value: 16-bit value to write, nbr: number of bytes to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteBytes(unsigned char *data,int RegAddress,int nbr)
{
  int res;

  res = I2C_Write(nbr, RegAddress , data);
	
