motoneil1/STC3117_arduino/stc3117_Driver.cpp
  return(res);
}

/* ---- End of I2C R/W interface --------------------------------------------- */


/* ---- Internal functions --------------------------------------------------- */

/*******************************************************************************
* Function Name  : STC3117_GetStatusWord
* Description    :  Read the STC3117 status
* Input          : None
* Return         : status word (16bit: REG_MODE and REG_CTRL), -1 if error
*******************************************************************************/
static int STC3117_GetStatusWord(void)
{
  int value;

  /* first, check the presence of the STC3117 by reading first byte of dev. ID */
  if (STC3117_ReadByte(STC3117_REG_ID)!= STC3117_ID) return (-1);

  /* read REG_MODE and REG_CTRL */
  value = STC3117_ReadWord(STC3117_REG_MODE);
  value &= 0x7fff;   //(MSbit is unused, but used for error dectection here)

  return (value);
}


/*******************************************************************************
* Function Name  : STC3117_CheckI2cDeviceId
* Description    :  Read the hardcoded STC3117 ID number
* Input          : pointer to char
* Return         : status, -1 if error, -2 if bad ID
*******************************************************************************/
int STC3117_CheckI2cDeviceId(void)
{
  unsigned char RegAddress;
  unsigned char data8;
  int status;

  RegAddress = STC3117_REG_ID;
  status = I2C_Read(1, RegAddress , &data8);

  if (status >= 0)
  {
	  if(data8 == STC3117_ID)
	  {
		  status = 0; //OK
	  }
	  else
	  {
		  status = -2; //I2C is working, but the ID doesn't match.
	  }
  }
  else
  {
	  status = -1; // I2C error
  }

  return(status);
}

/*******************************************************************************
* Function Name  : STC3117_GetRunningCounter
* Description    :  Get the STC3117 Convertion counter value
* Input          : None
* Return         : status word (REG_COUNTER), -1 if error
*******************************************************************************/
int STC3117_GetRunningCounter(void)
{
  unsigned short value;
  int status;

  /* read STC3117_REG_COUNTER */
  status = STC3117_ReadUnsignedWord(STC3117_REG_COUNTER, &value);

  if(status < 0) //error
	  value = -1;

  return ((int)value);
}

/*******************************************************************************
* Function Name  : STC3117_SetParamAndRun
* Description    :  initialize the STC3117 parameters and Start the device to monitor the battery
* Input          : rst: init algo param
* Return         : 0
*******************************************************************************/
static void STC3117_SetParamAndRun(STC3117_ConfigData_TypeDef *ConfigData)
{
  int value;
  
  /* set GG_RUN=0 before changing algo parameters */
  STC3117_WriteByte(STC3117_REG_MODE,STC3117_VMODE);
  
  /* init OCV curve */
	STC3117_WriteBytes((unsigned char*) ConfigData->OCVOffset, STC3117_REG_OCVTAB, STC3117_OCVTAB_SIZE);
  
  /* set alm level if different from default */
  if (ConfigData->Alm_SOC !=0 )   
     STC3117_WriteByte(STC3117_REG_ALARM_SOC,ConfigData->Alm_SOC*2); 
  if (ConfigData->Alm_Vbat !=0 ) 
  {
    value= ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
    STC3117_WriteByte(STC3117_REG_ALARM_VOLTAGE, value);
  }
    
  /* relaxation timer */
  if (ConfigData->Rsense !=0 )  
  {
    value= ((long)(ConfigData->RelaxCurrent << 9) / (CurrentFactor / ConfigData->Rsense));   /* LSB=8*5.88uV */
    STC3117_WriteByte(STC3117_REG_CURRENT_THRES,value); 
  }
  
  /* set parameters if different from default, only if a restart is done (battery change) */
  if (RAMData.reg.CC_cnf !=0 ) STC3117_WriteWord(STC3117_REG_CC_CNF,RAMData.reg.CC_cnf); 
  if (RAMData.reg.VM_cnf !=0 ) STC3117_WriteWord(STC3117_REG_VM_CNF,RAMData.reg.VM_cnf); 

  STC3117_WriteByte(STC3117_REG_CTRL,0x03);  /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
  STC3117_WriteByte(STC3117_REG_MODE, STC3117_GG_RUN | (STC3117_VMODE * ConfigData->Vmode) | (STC3117_ALM_ENA * ALM_EN));  /*   set GG_RUN=1, set mode, set alm enable */
 
}  




/*******************************************************************************
* Function Name  : STC3117_Startup
* Description    :  initialize and start the STC3117 at application startup
* Input          : None
* Return         : 0 if ok, -1 if error
*******************************************************************************/
static int STC3117_Startup(STC3117_ConfigData_TypeDef *ConfigData)
{
  int res;
  int ocv;
  
  /* check STC31xx status */
  res = STC3117_GetStatusWord();
  if (res<0) return(res);

  /* read OCV */
  ocv=STC3117_ReadWord(STC3117_REG_OCV);

  STC3117_SetParamAndRun(ConfigData);  /* set STC3117 parameters and run it  */
  
  /* rewrite ocv to start SOC with updated OCV curve */
  STC3117_WriteWord(STC3117_REG_OCV,ocv);
  
  return(0);
}


/*******************************************************************************
* Function Name  : STC3117_Restore
* Description    :  Restore STC3117 previous good state from values stored in internal 16byte RAM
* Input          : None
* Return         : 
*******************************************************************************/
static int STC3117_Restore(STC3117_ConfigData_TypeDef *ConfigData)
{
  int res;

  /* check STC31xx status */
  res = STC3117_GetStatusWord();
  if (res<0) return(res);
 
  STC3117_SetParamAndRun(ConfigData);  /* set STC3117 parameters and run it  */

  /* restore last SOC from STC3117 embedded RAM data for better accuracy */
  // Note: The latest SOC is saved every time GasGauge_Task() is called (i.e every 5s).
  STC3117_WriteWord(STC3117_REG_SOC,RAMData.reg.HRSOC); //force a new SoC to the fuel gauge

  return(0);
}




/*******************************************************************************
* Function Name  : STC3117_Powerdown
* Description    :  stop the STC3117 at application power down (i.e Standby mode with RAM content retention)
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_Powerdown(void)
{
  int res;
  
