motoneil1/STC3117_arduino/stc3117_Driver.cpp
  /* write 0x01 into the REG_CTRL to release IO0 pin open, */
  STC3117_WriteByte(STC3117_REG_CTRL, 0x01);

  /* write 0 into the REG_MODE register to put the STC3117 in standby mode */
   res = STC3117_WriteByte(STC3117_REG_MODE, 0);
   if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}




/*******************************************************************************
* Function Name  : STC3117_conv
* Description    : conversion utility 
*  convert a raw 16-bit value from STC3117 registers into user units (mA, mAh, mV, °C)
*  (optimized routine for efficient operation on 8-bit processors such as STM8)
* Input          : value, factor
* Return         : result = value * factor / 4096
*******************************************************************************/
static int STC3117_conv(short value, unsigned short factor)
{
  int v;
  
  v= ( (long) value * factor ) >> 11;
  v= (v+1)/2;
  
  return (v);
}

/*******************************************************************************
* Function Name  : STC3117_ReadBatteryData
* Description    :  utility function to read the battery data from STC3117
*                  to be called every 5s or so
* Input          : ref to BatteryData structure
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_ReadBatteryData(STC3117_BatteryData_TypeDef *BatteryData)
{
  unsigned char data[16];
  int res;
  int value;


  /* read STC3117 registers 0 to 14 */
	res = STC3117_ReadBytes(data, 0, 15);
	
  if (res<0) return(res);  /* read failed */
	
  /* fill the battery status data */
  /* SOC */
  value=data[3]; value = (value<<8) + data[2];
  BatteryData->HRSOC = value;     /* result in 1/512% */
  BatteryData->SOC = (value * 10 + 256) / 512; /* result in 0.1% */

  /* conversion counter */
  value=data[5]; value = (value<<8) + data[4];
  BatteryData->ConvCounter = value;

  /* current */
  value=data[7]; value = (value<<8) + data[6];
  value &= 0x3fff;   /* mask unused bits */
  if (value>=0x2000) value = value - 0x4000;  /* convert to signed value */
  BatteryData->Current = STC3117_conv(value, CurrentFactor/RSENSE);  /* result in mA */

  /* voltage */
  value=data[9]; value = (value<<8) + data[8];
  value &= 0x0fff; /* mask unused bits */
  if (value>=0x0800) value -= 0x1000;  /* convert to signed value */
  value = STC3117_conv(value,VoltageFactor);  /* result in mV */
  BatteryData->Voltage = value;  /* result in mV */

  /* temperature */
  value=data[10]; 
  if (value>=0x80) value -= 0x100;  /* convert to signed value */
  BatteryData->Temperature = value*10;  /* result in 0.1°C */

  /* OCV */
  value=data[14]; value = (value<<8) + data[13];
  value &= 0x3fff; /* mask unused bits */
  if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
  value = STC3117_conv(value,VoltageFactor);  
  value = (value+2) / 4;  /* divide by 4 with rounding */
  BatteryData->OCV = value;  /* result in mV */
  
//  res=STC3117_Read(1, STC3117_REG_RELAX_COUNT, data);
//  if (res<0) return(res);  /* read failed */
//  BatteryData->RelaxTimer = data[0];

  
  return(STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_ReadRamData
* Description    : utility function to read the internal RAM data from STC3117
* Input          : ref to RAM data array
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_ReadRamData(unsigned char *RamData)
{  
    return STC3117_ReadBytes(RamData, STC3117_REG_RAM, STC3117_RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3117_WriteRamData
* Description    : utility function to write the RAM data into STC3117
* Input          : ref to RAM data array
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteRamData(unsigned char *RamData)
{
	return STC3117_WriteBytes(RamData, STC3117_REG_RAM, STC3117_RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3117_CalcRamCRC8
* Description    : calculate the CRC8
* Input          : data: pointer to byte array, n: number of vytes
* Return         : CRC calue
*******************************************************************************/
static int STC3117_CalcRamCRC8(unsigned char *data, int n)
{
  int crc=0;   /* initial value */
  int i, j;

  for (i=0;i<n;i++)
  {
    crc ^= data[i];
    for (j=0;j<8;j++) 
    {
      crc <<= 1;
      if (crc & 0x100)  crc ^= 7;
    }
  }
  return(crc & 255);

}

/*******************************************************************************
* Function Name  : STC3117_UpdateRamCRC
* Description    : calculate the RAM CRC
* Input          : none
* Return         : CRC value
*******************************************************************************/
static int STC3117_UpdateRamCRC(void)
{
  int res;
  
  res=STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE-1);
  RAMData.db[STC3117_RAM_SIZE-1] = res;   /* last byte holds the CRC */
  return(res);
}

/*******************************************************************************
* Function Name  : STC3117_InitRamData
* Description    : Init the STC3117 RAM registers with valid test word and CRC
* Input          : STC3117_ConfigData_TypeDef structure
* Return         : none
*******************************************************************************/
static void STC3117_InitRamData(STC3117_ConfigData_TypeDef *ConfigData)
{
  int index;

  //Set full RAM tab to 0
  for (index=0;index<STC3117_RAM_SIZE;index++) 
    RAMData.db[index]=0;
  
  //Fill RAM regs
  RAMData.reg.TestWord=RAM_TESTWORD;  /* Fixed word to check RAM integrity */
  RAMData.reg.CC_cnf = ConfigData->CC_cnf;
  RAMData.reg.VM_cnf = ConfigData->VM_cnf;
  
  /* update the crc */
  STC3117_UpdateRamCRC();
}

