motoneil1/STC3117_arduino/stc3117_Driver.cpp
/* ---- End of Internal functions --------------------------------------------------- */

/* ---- Driver interface functions -------------------------------------------------- */


/*******************************************************************************
* Function Name  : STC3117_Initialization
* Description    : Start the STC3117 battery tracking algorithm system
* Input          : also parameters in stc3117_Battery.h file
* Return         : 0 is ok, -1 if STC3117 not found or I2C error
* Affect         : Initializes ConfigData and returns battery early status in BatteryData
*******************************************************************************/
int GasGauge_Initialization(STC3117_ConfigData_TypeDef *ConfigData, STC3117_BatteryData_TypeDef *BatteryData)
{


  int res, loop;
  int OCVOffset[32] = OCV_OFFSET_TAB;
  int SOCOffset[16] = SOC_OFFSET_TAB;
  /*** Fill configuration structure parameters ***/
  
  ConfigData->Vmode = VMODE;

  if(RSENSE!=0)	ConfigData->Rsense = RSENSE;
  else ConfigData->Rsense = 10; // default value to avoid division by 0
  
  ConfigData->CC_cnf = (BATT_CAPACITY * ConfigData->Rsense * 250 + 6194) / 12389;
	
  if(BATT_RINT!=0)	ConfigData->VM_cnf = (BATT_CAPACITY * BATT_RINT * 50 + 24444) / 48889;
  else ConfigData->VM_cnf = (BATT_CAPACITY * 200 * 50 + 24444) / 48889; // default value

  for(loop=0; loop<32; loop++)
  {
  // Serial.print("\n");
  // Serial.print(loop);
  // Serial.print("\n");
  // Serial.print(OCVOffset[loop]);
	if(OCVOffset[loop] > 127) OCVOffset[loop] = 127;
	if(OCVOffset[loop] < -127) OCVOffset[loop] = -127;
	ConfigData->OCVOffset[loop] = OCVOffset[loop];
  }
  for(loop=0; loop<16; loop++)
  {
	if(SOCOffset[loop] > 127) SOCOffset[loop] = 127;
	if(SOCOffset[loop] < -127) SOCOffset[loop] = -127;
	 ConfigData->SOCOffset[loop] = SOCOffset[loop];
  }
  
  ConfigData->Cnom = BATT_CAPACITY; 
  ConfigData->RelaxCurrent = BATT_CAPACITY / 20;
  
  ConfigData->Alm_SOC = ALM_SOC;
  ConfigData->Alm_Vbat = ALM_VBAT;
  
  
  /*** Initialize Gas Gauge system ***/ 
  
  /*BatteSTC3117_ReadRamDatary presence status init*/
  BatteryData->Presence = 1;

  /* check RAM data validity */ 
  //refer to AN4324, Figure 16: STC3115 initialization type selection flowchart
  {
	// ** Internal RAM purpose: **
	// The STC3115 device embeds a 16-byte RAM memory area.
	// The registers of this area can be used to periodically save the battery status. 
	// This allows battery information to be recovered when the application is stopped but the battery is not unplugged.
	//
	// Typical use case of STC3115 Restoration is:
	// User Platform power down (but stc3115 set in standby mode), no battery removal, and then Platform power up (stc3115 set in running mode). So Battery state context can be restored. 
	// If the battery is removed or in case of soft reset (STC3115 soft reset), RAM content is reset, the SOC tracking will restart from zero (not use the RAM content). So there is no restoration in this condition.


	  STC3117_ReadRamData(RAMData.db);
 
	  if ( (RAMData.reg.TestWord != RAM_TESTWORD) || (STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE)!=0) ) //RAM invalid
	  {
		// RAM is empty (Fuel gauge first power-up)
		// or RAM not yet initialized by this Driver (no TESTWORD)
		// or RAM corrupted (bad CRC)
		// => Full initialisation:  STC3115 init + RAM init
		//    e.g. New battery plugged-in, using the initial battery model.
		
		STC3117_InitRamData(ConfigData);
		res=STC3117_Startup(ConfigData);  /* return -1 if I2C error or STC3117 not present */

	  }
	  else //RAM valid (i.e initialization process started again, battery has not been removed)
	  {
		  /* check STC3117 status */
		  if ( (STC3117_ReadByte(STC3117_REG_CTRL) & (STC3117_BATFAIL | STC3117_PORDET)) != 0 )
		  {
				//PORDET detected (Power On Reset occurred after Device powered-On or a Soft-reset)
				//or Error occured: BATFAIL (battery disconnected or Undervoltage UVLO)
				// => Standard initialisation: STC3117 init (without RAM init)
			    //    e.g. Battery has not been removed, but restoration from internal RAM not possible

				res=STC3117_Startup(ConfigData);  /* return -1 if I2C error or STC3117 not present */
    // Serial.print(res);
		  }
		  else //Restoration OK, The battery has not been removed since the last application switch off. (no specific event occured, restore the latest good SoC value for better accuracy)
		  {
				res=STC3117_Restore(ConfigData); /* recover from last SOC */
		  }
	  }
  }

	//Update RAM state flag to INIT state
	{
		RAMData.reg.STC3117_State = STC3117_INIT;
		STC3117_UpdateRamCRC();
		STC3117_WriteRamData(RAMData.db);
	}
  
  return(res);    /* return -1 if I2C error or STC3117 not present */
}

/*******************************************************************************
* Function Name  : GasGauge_Reset
* Description    : Reset the Gas Gauge system, this function must not be used frequently
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int GasGauge_Reset(void)  
{
  int res;

  /* reset RAM */
  RAMData.reg.TestWord=0;  
  RAMData.reg.STC3117_State = STC3117_UNINIT;
  res = STC3117_WriteRamData(RAMData.db);
  if(res != STC3117_OK) return res;
  
  /* reset STC3117*/
  res = STC3117_WriteByte(STC3117_REG_CTRL, STC3117_PORDET);  /*   set Soft Reset */

  return res;
}



/*******************************************************************************
* Function Name  : GasGauge_Stop
* Description    : Stop the Gas Gauge system and save the context in STC3117 RAM
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int GasGauge_Stop(void)
{
  int res;
  
  /*Save context in RAM*/
  STC3117_ReadRamData(RAMData.db);
  RAMData.reg.STC3117_State= STC3117_POWERDN;
  
  /* update the crc */
  STC3117_UpdateRamCRC();
  STC3117_WriteRamData(RAMData.db);
   
  /*STC3117 Power down (ie Standby mode with RAM content retention))*/
  res=STC3117_Powerdown();
  if (res!=0) return (-1);  /* error */

  return(0);  
}



