motoneil1/STC3117_arduino/stc3117_Driver.cpp
/*******************************************************************************
* Function Name  : GasGauge_Task
* Description    : Periodic Gas Gauge task, to be called periodically (every 1 to 60 seconds)
* Input          : STC3117 ConfigData structure filled by GasGauge_Initialization function
* Return         : 1 if data available, 0 if no data, -1 if error
* Affect         : Fill the BatteryData structure with updated battery status
*******************************************************************************/
int GasGauge_Task(STC3117_ConfigData_TypeDef *ConfigData,STC3117_BatteryData_TypeDef *BatteryData)
{
  int res;

  /* ----------------------------- System state verification ---------------------------- */
  /*Read STC3117 status registers */
  res=STC3117_GetStatusWord();

  if (res<0) return(res);  /* return if I2C error or STC3117 not responding */  
  BatteryData->StatusWord = res;
  
  /* check STC3117 RAM status (battery has not been changed) */
  STC3117_ReadRamData(RAMData.db);
  if ( (RAMData.reg.TestWord!= RAM_TESTWORD) || (STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE)!=0) )
  {
    /* if RAM non ok, reset it and set init state */
    STC3117_InitRamData(ConfigData); 
    RAMData.reg.STC3117_State = STC3117_INIT;
  }  
  
  /* check battery presence status */
  if ((BatteryData->StatusWord & ((int)STC3117_BATFAIL<<8)) != 0)
  {
    /*Battery disconnection has been detected			*/
		
	/*BATD pin level is over 1.61 or Vcc is below 2.7V	*/
	BatteryData->Presence = 0;
	
	/*HW and SW state machine reset*/
    GasGauge_Reset();

    return (-1);
  }
	
  /* check STC3117 running mode*/
  if ((BatteryData->StatusWord & STC3117_GG_RUN) == 0) //Gas gauge no more running (in Standby mode)
  {
		if( (RAMData.reg.STC3117_State == STC3117_RUNNING) ||
			(RAMData.reg.STC3117_State == STC3117_POWERDN)
			)
		{
			STC3117_Restore(ConfigData);  /* if RUNNING state, restore STC3117 with latest good SoC value for better accuracy */
		}
		else
		{
			STC3117_Startup(ConfigData);  /* if INIT state, initialize STC3117*/
		}
		
    RAMData.reg.STC3117_State = STC3117_INIT;
  }
  
  /* --------------------------------- Read battery data ------------------------------- */

  res=STC3117_ReadBatteryData(BatteryData);  
  if (res!=0) return(-1); /* abort in case of I2C failure */
  
  
  /* ------------------------------- battery data report ------------------------------- */
  /* check INIT state */
  if (RAMData.reg.STC3117_State == STC3117_INIT)
  {
    /* INIT state, wait for current & temperature value available: */
    if (BatteryData->ConvCounter > VCOUNT) 
    {
        RAMData.reg.STC3117_State = STC3117_RUNNING;
		/*Battery is connected*/
		BatteryData->Presence = 1;
    }
  }

  if (RAMData.reg.STC3117_State != STC3117_RUNNING) /* not running : data partially available*/
  {
  	BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
    BatteryData->Current=0;
	BatteryData->Temperature=250;
    BatteryData->RemTime = -1;
  }
  else /* STC3117 running */
  {
  
	/* ---------- process SW algorithms -------- */
		
	/* early empty compensation */
	if (BatteryData->Voltage < APP_CUTOFF_VOLTAGE)
		BatteryData->SOC = 0;
	else if (BatteryData->Voltage < (APP_CUTOFF_VOLTAGE+VOLTAGE_SECURITY_RANGE))
	{
		// Recommended software security: scaling down the SOC if voltage is considered too close to the cutoff voltage. (no accuracy effect) 
		BatteryData->SOC = BatteryData->SOC * (BatteryData->Voltage - APP_CUTOFF_VOLTAGE) / VOLTAGE_SECURITY_RANGE;   
	}

	/* Battery charge value calculation */
	BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;

	if ((BatteryData->StatusWord & STC3117_VMODE) == 0) /* mixed mode only*/
	{  
		
		/*Lately fully compensation*/
		if ((BatteryData->StatusWord & STC3117_VMODE) == 0) /*running in mixed mode*/
		{ 
			
			if(BatteryData->Current > APP_EOC_CURRENT && BatteryData->SOC > 990)
			{
				BatteryData->SOC = 990;
				STC3117_WriteWord(STC3117_REG_SOC,50688);   /* 99% */  //force a new SoC displayed by fuel gauge
			}
		}
		
		/*Remaining time calculation*/
		if(BatteryData->Current < 0)
		{
			BatteryData->RemTime = (BatteryData->RemTime * 4 + BatteryData->ChargeValue / BatteryData->Current * 60 ) / 5;
			if( BatteryData->RemTime  < 0)
				BatteryData->RemTime = -1; /* means no estimated time available */
		}
		else
			BatteryData->RemTime = -1; /* means no estimated time available */
		
	}
	else /* voltage mode only */
	{
		BatteryData->Current=0;
		BatteryData->RemTime = -1;
	}
	
	//SOC min/max clamping
	if(BatteryData->SOC>1000) BatteryData->SOC = MAX_SOC;
	if(BatteryData->SOC<0) BatteryData->SOC = 0;

  }
      
  /* save SOC to internal RAM (in case of future Restore process) */
  {
	  RAMData.reg.HRSOC = BatteryData->HRSOC;
	  RAMData.reg.SOC = (BatteryData->SOC+5)/10;
	  STC3117_UpdateRamCRC();
	  STC3117_WriteRamData(RAMData.db);
  }

  if (RAMData.reg.STC3117_State==STC3117_RUNNING)
    return(1);
  else
    return(0);  /* only SOC, OCV and voltage are valid */
}



/*******************************************************************************
* Function Name  : STC3117_SetPowerSavingMode
* Description    : Set the power saving mode
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_SetPowerSavingMode(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /* Set the VMODE bit to 1 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res | STC3117_VMODE));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_StopPowerSavingMode
* Description    : Stop the power saving mode
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_StopPowerSavingMode(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /*STC3117 is in power saving mode by default, cannot be set dynamically in mixed mode.		*/
  /*Change stc3117_Driver.h VMODE parameter, and connect an external sense resistor to STC3117	*/
  if (VMODE != MIXED_MODE) return (!STC3117_OK); 
  
  /* Set the VMODE bit to 0 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res & ~STC3117_VMODE));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}

